## Plan for orchestrator
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.scan_runner_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_runner_policies"  {
      ~ id      = "2046029855" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs:log-group:/aws/ecs/runners_owasp_zap_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_nuclei_ecs:log-group:/aws/ecs/runners_nuclei_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_nuclei_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/scanners/owasp-zap"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:DescribeTaskDefinition",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:4"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateStateMachine",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:507252742351:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:507252742351:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::507252742351:role/security_tools_execution_role",
                          - "arn:aws:iam::507252742351:role/container_execution_role",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/scanners/owasp-zap",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_ecr_repository.orchestrator must be replaced
-/+ resource "aws_ecr_repository" "orchestrator" {
      ~ arn                  = "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/scanners/owasp-zap" -> (known after apply)
      ~ id                   = "scan-websites/scanners/owasp-zap" -> (known after apply)
      ~ name                 = "scan-websites/scanners/owasp-zap" -> "scan-websites/orchestrator" # forces replacement
      ~ registry_id          = "507252742351" -> (known after apply)
      ~ repository_url       = "507252742351.dkr.ecr.ca-central-1.amazonaws.com/scan-websites/scanners/owasp-zap" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.orchestrator will be updated in-place
  ~ resource "aws_iam_policy" "orchestrator" {
        id        = "arn:aws:iam::507252742351:policy/scan-websites-orchestrator"
        name      = "scan-websites-orchestrator"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs:log-group:/aws/ecs/runners_owasp_zap_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_nuclei_ecs:log-group:/aws/ecs/runners_nuclei_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_nuclei_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/scanners/owasp-zap"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:DescribeTaskDefinition",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:4"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateStateMachine",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:507252742351:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:507252742351:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::507252742351:role/security_tools_execution_role",
                          - "arn:aws:iam::507252742351:role/container_execution_role",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.zap_runner_policies will be created
  + resource "aws_iam_policy" "zap_runner_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "OWASPZapTaskExecutionPolicies"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs:log-group:/aws/ecs/runners_owasp_zap_ecs:log-stream:*",
                          + "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs",
                          + "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_nuclei_ecs:log-group:/aws/ecs/runners_nuclei_ecs:log-stream:*",
                          + "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_nuclei_ecs",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:ca-central-1:507252742351:subnet/*",
                          + "arn:aws:ec2:ca-central-1:507252742351:network-interface/*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = "ec2:DescribeNetworkInterfaces"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObjectAcl",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::scan-websites-production-owasp-zap-report-data/*",
                          + "arn:aws:s3:::scan-websites-production-owasp-zap-report-data",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.zap_runner_policies will be created
  + resource "aws_iam_role_policy_attachment" "zap_runner_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "security_tools_execution_role"
    }

  # aws_lambda_function.orchestrator will be created
  + resource "aws_lambda_function" "orchestrator" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "orchestrator"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::507252742351:role/scan-websites-orchestrator"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLUSTER"                      = "arn:aws:ecs:ca-central-1:507252742351:cluster/scanning-tools"
              + "MAX_ECS_CAPACITY"             = "5"
              + "MIN_ECS_CAPACITY"             = "1"
              + "NUCLEI_TASK_DEF_ARN"          = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:3"
              + "OWASP_ZAP_REPORT_DATA_BUCKET" = "scan-websites-production-owasp-zap-report-data"
              + "OWASP_ZAP_SCAN_THREADS"       = "3"
              + "OWASP_ZAP_TASK_DEF_ARN"       = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:4"
              + "PRIVATE_SUBNETS"              = "subnet-0c3abcc29d00b8589,subnet-0d16dd34a0f0a4589,subnet-0e48adc704a15a982"
              + "SECURITY_GROUP"               = "sg-0ffc24ab70e3c764d"
              + "STEP_FUNC_ROLE_ARN"           = "arn:aws:iam::507252742351:role/container_execution_role"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0ffc24ab70e3c764d",
            ]
          + subnet_ids         = [
              + "subnet-0c3abcc29d00b8589",
              + "subnet-0d16dd34a0f0a4589",
              + "subnet-0e48adc704a15a982",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_permission.orchestrator will be created
  + resource "aws_lambda_permission" "orchestrator" {
      + action        = "lambda:InvokeFunction"
      + function_name = "orchestrator"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:ca-central-1:507252742351:owasp-zap-urls"
      + statement_id  = "AllowZapRunnerSNSInvoke"
    }

  # aws_sns_topic_subscription.orchestrator-lambda-subscription will be created
  + resource "aws_sns_topic_subscription" "orchestrator-lambda-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:507252742351:owasp-zap-urls"
    }

Plan: 6 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nuclei-log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.owasp-zap-log"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.runners-nuclei"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.runners-owasp-zap"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.runners-nuclei"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.runners-owasp-zap"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.zap_runner_policies"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.container_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.task_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.security_tools_scanning"]

22 tests, 8 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
